In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('Titanic_dataset.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

1-Kazada ölenlerin yaş ortalamasını bul

In [5]:
df['Age'].mean()

29.69911764705882

Kazada ölenlerin yaş ortalaması 29.6

2-Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [11]:
ortalama=df['Fare'].mean()
medyan=df['Fare'].median()
print(f"ortalama:{ortalama}, medyan:{medyan}")

ortalama:32.204207968574636, medyan:14.4542

3-Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [16]:
df[df['Sex']=='male']['Age'].mean()

30.72664459161148

4-Kazada ölen Kadınların yaş ortalamasını bulunuz

In [17]:
df[df['Sex']=='female']['Age'].mean()

27.915708812260537

5-Kazadan kurtulanların yaş ortalamasını bulunuz

In [18]:
df[df['Survived']==1]['Age'].mean()

28.343689655172415

6-Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [19]:
df[df['Survived']==1]['Fare'].mean()

48.39540760233918

7-Kazadan kurtulan toplam kişi sayısını bulunuz…

In [22]:
kurtulan_sayisi=(df['Survived']==1).sum()
kurtulan_sayisi

342

8-10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [23]:
df[df['Age']<10]['Fare'].median()

27.0

9-1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız.
(Pclass değişkeni sınıfları barındırmaktadır.)

In [25]:
for sinif in sorted(df['Pclass'].unique()):
    ortalama = df[df['Pclass'] == sinif]['Fare'].mean()
    medyan = df[df['Pclass'] == sinif]['Fare'].median()
    print(f"{sinif}. Sınıf - Ortalama: {ortalama:.2f}, Medyan: {medyan:.2f}")

1. Sınıf - Ortalama: 84.15, Medyan: 60.29
2. Sınıf - Ortalama: 20.66, Medyan: 14.25
3. Sınıf - Ortalama: 13.68, Medyan: 8.05

In [26]:
gruplar = df.groupby('Pclass')['Fare']
print(gruplar.agg(['mean', 'median']))

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

10-Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için;
ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.

In [41]:
erkekler = df[df['Sex'] == 'male']
olenerkekoran=(erkekler['Survived']==0).sum()/len(erkekler)
olenerkekoran

0.8110918544194108

In [42]:
kadinlar=df[df['Sex']=='female']
olenkadinoran=(kadinlar['Survived']==0).sum()/len(kadinlar)
olenkadinoran

0.25796178343949044